{
  "basics": {
    "name": "Andrew Panfilov",
    "label": "Engineering Manager | Software Architect | AI/ML Systems & Distributed Architecture",
    "email": "andrew@dzer6.com",
    "summary": "Engineering leader with 21+ years of experience architecting scalable, distributed systems and managing high-performing technical teams. Proven track record in establishing architectural standards, leading engineering managers and architects, and driving technical excellence across organizations. Deep expertise in cloud platforms (AWS, GCP), domain-driven design, microservices architecture, and AI/ML integration including LLMs and RAG pipelines. Successfully built and mentored cross-functional teams, implemented architectural governance processes, and delivered large-scale systems for fintech, e-commerce, and SaaS companies. Passionate about fostering collaborative team cultures while maintaining rigorous quality standards and architectural best practices.",
    "picture": "",
    "location": {
      "address": "Mislata",
      "postalCode": "46920",
      "city": "Valencia",
      "countryCode": "ES",
      "region": "Valencia"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "dzer6",
        "url": "https://github.com/dzer6"
      },
      {
        "network": "LinkedIn",
        "username": "andrewpanfilov",
        "url": "https://linkedin.com/in/andrewpanfilov"
      }
    ]
  },
  "skills": [
  ],
  "work": [
    {
      "company": "Kingpin.ai",
      "position": "Head of Engineering",
      "startDate": "2025-08-01",
      "endDate": "2025-12-31",
      "summary": "Fashion retail startup focused on AI-driven solutions for the fashion industry.",
      "highlights": [
        "Established development processes, transitioning from scrumban to scrum. Recruited key team members including BA/PO/PM role. Designed new product architecture and customer system integrations (CRM/ERP).",
        "Led people management, budget optimization, and weekly delivery metrics. Selected Low-Code/No-Code platforms, drove AI-assisted programming adoption, managed technical debt and Incident Management/Observability.",
        "Managed cloud migration from AWS to GCP and engaged 3rd party vendors for non-core functions (Sales Through Reporting, Demand Forecasting, custom reports)."
      ]
    },
    {
      "company": "Sira Sight AI",
      "position": "Founding Engineer",
      "startDate": "2025-05-01",
      "endDate": "2025-08-01",
      "summary": "Clinical research technology startup providing AI-powered solutions for clinical site cost benchmarking, budgeting, and management for Clinical Research Sites, CROs, and Pharmaceutical Sponsors.",
      "highlights": [
        "Sole engineer building complete MVP from scratch (frontend, backend, infrastructure). Leveraged AI Coding Assistants to deliver full product in 3 months.",
        "Built proprietary AI-powered data extraction engine for Clinical Trial Agreements (CTAs) and clinical trial budgets from Excel/PDF files.",
        "Implemented data cleansing pipeline with global dictionaries for budget records mapping. Created AI-driven Schedule of Events generation and budget prediction using generative AI."
      ]
    },
    {
      "company": "Mitralex",
      "position": "Technical Consultant",
      "startDate": "2025-04-01",
      "endDate": "2025-05-01",
      "summary": "Ukrainian LegalTech startup developing an intelligent chatbot for legal consultations based on Ukrainian legislation.",
      "highlights": [
        "Built Retrieval component for RAG system. Designed document processing pipeline for legal acts collected via web crawler.",
        "Implemented optimized chunking strategy for vector search, enabling efficient retrieval from large legislative document collections."
      ]
    },
    {
      "company": "Techstack / Optimality",
      "position": "Software Architect, Engineering Manager",
      "startDate": "2024-08-31",
      "endDate": "2025-04-01",
      "summary": "Led architecture and engineering management efforts for a smart business process automation system serving major clients in the oil and gas industry in the US (Chevron) and Japan (Chiyoda Corp).",
      "highlights": [
        "Designed multitenant architecture with CQRS patterns, BPM functionality, LLM data processing pipeline, and intelligent chatbot.",
        "Established delivery processes, introduced scrum methodologies, improved backlog quality through gap analysis and team mentoring.",
        "Facilitated collaboration among distributed teams in Poland, Ukraine, Vietnam, Indonesia, and the US."
      ]
    },
    {
      "company": "Playtika",
      "position": "R&D Team Lead",
      "startDate": "2024-03-01",
      "endDate": "2024-08-31",
      "summary": "Led the R&D team to optimize software delivery processes and implement Scrum methodologies across projects, enhancing both efficiency and product quality.",
      "highlights": [
        "Managed diverse team of 14 members (5 client-side, 5 server-side programmers, 3 testers, 1 PO), with 9 direct reports.",
        "Built trusting relationships with team members in Kyiv and Vinnytsia offices during the war, ensuring psychological well-being.",
        "Developed mitigation strategy focusing on static code analysis of C++ codebase and test coverage for high-risk components to reduce game crashes."
      ]
    },
    {
      "company": "Stealth Startup",
      "position": "Founding Engineer",
      "startDate": "2024-01-12",
      "endDate": "2024-12-31",
      "summary": "Platform for hourly car rental services enabling flexible vehicle access for consumers.",
      "highlights": [
        "Founding engineer focused on backend development. Designed entire system architecture and led development process with another founding engineer.",
        "Built single-page web application using JVM/Clojure backend, Vue.js frontend, WebSockets. Deployed to AWS using Terraform, PostgreSQL, and AWS Cognito.",
        "Integrated with SmartCar API to abstract vehicle management across different car manufacturers."
      ]
    },
    {
      "company": "Elevator Research Services",
      "position": "Chief Technology Officer",
      "startDate": "2022-09-01",
      "endDate": "2024-01-12",
      "summary": "Conversational AI SaaS startup (chatbot tools for marketing research)",
      "highlights": [
        "As an early-stage startup CTO, my role encompassed a broad range of responsibilities to establish and advance our technological footprint in the SaaS and Conversational AI space. Key achievements include:",
        "Team Building & Leadership: Recruited and mentored a highly competent development team, fostering a culture of innovation and efficiency. My leadership approach involved close mentorship, ensuring team members were well-equipped with the necessary skills and knowledge to excel in their roles.",
        "AWS Cloud Cost Optimization: Implemented strategic solutions for cloud cost management, focusing on optimizing our AWS infrastructure. This involved careful planning and execution to balance performance with cost-effectiveness, ensuring maximum efficiency of our cloud resources.",
        "Architecting LLM Pipeline: Designed and built a comprehensive three-stage Large Language Model (LLM) pipeline, tailored to enhance our conversational AI capabilities. The stages included:",
        "Chatbot Dialogue Setup: Developed sophisticated prompt engineering techniques to set up engaging and effective chatbot conversations, ensuring a seamless interaction experience for users.",
        "Fieldwork with LLM: Managed the deployment of chatbots in real-world scenarios, where they interacted with respondents using advanced LLM techniques. This phase was crucial in gathering valuable insights and testing the effectiveness of our conversational AI in actual use cases.",
        "Data Analysis and Processing: Led the development of complex data analysis methods, including categorization, tagging, Personally Identifiable Information (PII) clearance, entity extraction, and sentiment detection. This stage was essential for deriving meaningful insights from chatbot interactions and continuously improving our AI models."
      ]
    },
    {
      "company": "Synqrinus",
      "position": "Director Of Engineering",
      "startDate": "2021-06-01",
      "endDate": "2022-09-01",
      "summary": "Marketing research agency.",
      "highlights": [
        "Achievements: I led a diverse team of software developers to build and optimise proprietary marketing research tools. I set up and led efficient processes to enable the team to operate with clear communication, accountability, and tracking. I focused on empowering my team and providing coaching and growth opportunities.",
        "Responsibilities: people management; composing high and low-level design of the software; code review; hiring new engineers; leading group of engineers; coaching and experience transferring.",
        "Technologies and tools: Clojure, ClojureScript, Java, Apache Camel, Postgres, Docker, AWS, Git, Github, JIRA."
      ]
    },
    {
      "company": "Takeoff Technologies (Awarded as Technology Pioneer by World Economic Forum in 2020)",
      "position": "Senior Software Developer/Technical Lead/Engineering Lead/Software Architect",
      "startDate": "2018-03-01",
      "endDate": "2021-06-01",
      "summary": "Takeoff Technologies – robotic micro-fulfilment centres.",
      "highlights": [
        "Initially, as a Senior Software Developer, I designed and implemented crucial components for the integration with robotic shelves and legacy ERP/WMS systems, and developed a stable and robust e-commerce system service contracts component. Later, as Technical Lead and Software Architect, I led the team responsible for MFCaaS-retailers integration, orchestrating business process automation, ETL components for third-party data processing, and adapting legacy ERP/WMS integration. As an Engineering Lead, I managed several teams working on assortment, replenishment, retailer integration, and warehouse inbound processes. My responsibilities spanned people management, software design, code reviews, technical documentation, and incident management in production environments.",
        "Technologies and tools: Clojure, ClojureScript, Java, Postgres, ArangoDB, CouchDB, Redis, OracleDB, Docker, Apache Camel, JSON, EDN Git, Github, JIRA."
      ]
    },
    {
      "company": "Zapflow",
      "position": "Senior Full Stack Software Developer",
      "startDate": "2017-03-01",
      "endDate": "2018-02-01",
      "summary": "Deal Flow Power Tool for VC & PE.",
      "highlights": [
        "Responsibilities: programming; code review; coaching and experience transferring; requirement analysis, tasks breakdown and estimating.",
        "Technologies and tools: Clojure, Immutant, ClojureScript, Reagent, React, ReactBootstrap, HTML, JavaScript, SCSS, Datomic, AWS, Docker, JSON, EDN, Datalog, Git, Github, Trello, Youtrack, CircleCI."
      ]
    },
    {
      "company": "Cogniance",
      "position": "Senior Software Developer/Lead Software Developer/Software Architect",
      "startDate": "2012-08-01",
      "endDate": "2017-03-01",
      "summary": "",
      "highlights": []
    },
    {
      "company": "Ciklum",
      "position": "Senior Software Developer",
      "startDate": "2012-01-01",
      "endDate": "2012-08-01",
      "summary": "",
      "highlights": []
    },
    {
      "company": "Topspin / Front Porch Digital (acquired by Oracle in 2014)",
      "position": "Senior Software Developer",
      "startDate": "2010-12-01",
      "endDate": "2011-12-01",
      "summary": "",
      "highlights": []
    },
    {
      "company": "Exadel / John Hancock Investment Management",
      "position": "Software Developer",
      "startDate": "2010-09-01",
      "endDate": "2010-12-01",
      "summary": "",
      "highlights": []
    },
    {
      "company": "Nighterra",
      "position": "Software Developer",
      "startDate": "2004-02-01",
      "endDate": "2010-09-01",
      "summary": "",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Donetsk National Technical University",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2000-09-01",
      "endDate": "2004-07-01"
    }
  ],
  "publications": [],
  "languages": [
    {
      "language": "English",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Ukrainian",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Russian",
      "fluency": "Native"
    }
  ],
  "interests": [
  ]
}
