{
  "basics": {
    "name": "Andrew Panfilov",
    "label": "Programmer | Software Architect | Early-stage startup enthusiast",
    "email": "andrew@dzer6.com",
    "summary": "With over two decades of extensive experience, I have worked for companies across Canada, the US, and Europe, specializing in architecting scalable, high-load systems and fostering robust engineering cultures. My career has spanned various domains, including marketing research tech, micro-fulfillment automation, ad tech, big data analysis, and conversational AI. I have led and mentored development teams, driving innovation and optimizing cloud infrastructure. My accomplishments include designing a comprehensive Large Language Model pipeline that enhanced chatbot capabilities, from dialogue setup to advanced data analysis and processing. As a passionate advocate for functional programming, I leverage languages like Clojure to build resilient and efficient systems. I enjoy sharing my knowledge through tech blogging and speaking at industry meetups, focusing on software architecture, engineering organization culture, and functional programming.",
    "picture": "",
    "location": {
      "address": "Mislata",
      "postalCode": "46920",
      "city": "Valencia",
      "countryCode": "ES",
      "region": "Valencia"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "dzer6",
        "url": "https://github.com/dzer6"
      },
      {
        "network": "LinkedIn",
        "username": "andrewpanfilov",
        "url": "https://linkedin.com/in/andrewpanfilov"
      }
    ]
  },
  "skills": [
  ],
  "work": [
    {
      "company": "Techstack / Optimality",
      "position": "Software Architect, Engineering Manager",
      "startDate": "2024-08-31",
      "endDate": "2025-04-01",
      "summary": "Led architecture and engineering management efforts for a smart business process automation system serving major clients in the oil and gas industry in the US and Japan.",
      "highlights": [
        "Architected subsystems for a complex project utilizing asynchronous CQRS patterns and integrating diverse technologies, ensuring scalability and reliability.",
        "Established and optimized delivery processes, introduced scrum methodologies, and guided teams in adopting structured workflows.",
        "Improved backlog quality by backlog analyzing, identifying gaps, and mentoring teams to create detailed, actionable backlog items.",
        "Conducted Buy vs Build analyses for subsystems, accounting for the project's technological complexity and client-specific requirements.",
        "Mentored team members in corporate communication, expectation management, and cross-team coordination across three distributed teams.",
        "Facilitated collaboration among geographically distributed teams in Poland, Ukraine, Vietnam, Indonesia, and the US, ensuring seamless communication and alignment.",
        "Directed the infrastructure team, ensuring their contributions aligned with project goals and deadlines."
      ]
    },
    {
      "company": "Playtika",
      "position": "R&D Team Lead",
      "startDate": "2024-03-01",
      "endDate": "2024-08-31",
      "summary": "Led the R&D team to optimize software delivery processes and implement Scrum methodologies across projects, enhancing both efficiency and product quality.",
      "highlights": [
        "Managed a diverse team comprising 5 client-side programmers, 5 server-side programmers, 3 testers, and 1 Product Owner, with 9 individuals directly under my supervision.",
        "Built and maintained trusting relationships with team members, including those working in the Kyiv and Vinnytsia offices during the war, ensuring their psychological well-being and fostering a supportive work environment.",
        "Implemented people-management strategies to support team members working under challenging conditions, maintaining high morale and engagement.",
        "Facilitated effective communication and collaboration within the team, enabling seamless coordination between client-side and server-side development efforts.",
        "Empowered team members to take ownership and accountability for their work, promoting a culture of responsibility and initiative.",
        "Supported the Product Owner in maximizing their effectiveness within an agile framework, ensuring clear and prioritized product backlogs.",
        "Guided Scrum teams in practicing Scrum principles and fostering continuous improvement, enhancing overall team performance.",
        "Developed comprehensive mitigation strategy focusing on static code analysis of C++ codebase and augmenting test coverage for high-risk components, aiming to reduce game crashes."
      ]
    },
    {
      "company": "Elevator Research Services",
      "position": "Chief Technology Officer",
      "startDate": "2022-09-01",
      "endDate": "2024-01-12",
      "summary": "Conversational AI SaaS startup (chatbot tools for marketing research)",
      "highlights": [
        "As an early-stage startup CTO, my role encompassed a broad range of responsibilities to establish and advance our technological footprint in the SaaS and Conversational AI space. Key achievements include:",
        "Team Building & Leadership: Recruited and mentored a highly competent development team, fostering a culture of innovation and efficiency. My leadership approach involved close mentorship, ensuring team members were well-equipped with the necessary skills and knowledge to excel in their roles.",
        "AWS Cloud Cost Optimization: Implemented strategic solutions for cloud cost management, focusing on optimizing our AWS infrastructure. This involved careful planning and execution to balance performance with cost-effectiveness, ensuring maximum efficiency of our cloud resources.",
        "Architecting LLM Pipeline: Designed and built a comprehensive three-stage Large Language Model (LLM) pipeline, tailored to enhance our conversational AI capabilities. The stages included:",
        "Chatbot Dialogue Setup: Developed sophisticated prompt engineering techniques to set up engaging and effective chatbot conversations, ensuring a seamless interaction experience for users.",
        "Fieldwork with LLM: Managed the deployment of chatbots in real-world scenarios, where they interacted with respondents using advanced LLM techniques. This phase was crucial in gathering valuable insights and testing the effectiveness of our conversational AI in actual use cases.",
        "Data Analysis and Processing: Led the development of complex data analysis methods, including categorization, tagging, Personally Identifiable Information (PII) clearance, entity extraction, and sentiment detection. This stage was essential for deriving meaningful insights from chatbot interactions and continuously improving our AI models."
      ]
    },
    {
      "company": "Synqrinus",
      "position": "Director Of Engineering",
      "startDate": "2021-06-01",
      "endDate": "2022-09-01",
      "summary": "Marketing research agency.",
      "highlights": [
        "Achievements: I led a diverse team of software developers to build and optimise proprietary marketing research tools. I set up and led efficient processes to enable the team to operate with clear communication, accountability, and tracking. I focused on empowering my team and providing coaching and growth opportunities.",
        "Responsibilities: people management; composing high and low-level design of the software; code review; hiring new engineers; leading group of engineers; coaching and experience transferring.",
        "Technologies and tools: Clojure, ClojureScript, Java, Apache Camel, Postgres, Docker, AWS, Git, Github, JIRA."
      ]
    },
    {
      "company": "Takeoff Technologies (Awarded as Technology Pioneer by World Economic Forum in 2020)",
      "position": "Senior Software Developer/Technical Lead/Engineering Lead/Software Architect",
      "startDate": "2018-03-01",
      "endDate": "2021-06-01",
      "summary": "Takeoff Technologies – robotic micro-fulfilment centres.",
      "highlights": [
        "Initially, as a Senior Software Developer, I designed and implemented crucial components for the integration with robotic shelves and legacy ERP/WMS systems, and developed a stable and robust e-commerce system service contracts component. Later, as Technical Lead and Software Architect, I led the team responsible for MFCaaS-retailers integration, orchestrating business process automation, ETL components for third-party data processing, and adapting legacy ERP/WMS integration. As an Engineering Lead, I managed several teams working on assortment, replenishment, retailer integration, and warehouse inbound processes. My responsibilities spanned people management, software design, code reviews, technical documentation, and incident management in production environments.",
        "Technologies and tools: Clojure, ClojureScript, Java, Postgres, ArangoDB, CouchDB, Redis, OracleDB, Docker, Apache Camel, JSON, EDN Git, Github, JIRA."
      ]
    },
    {
      "company": "Zapflow",
      "position": "Senior Full Stack Software Developer",
      "startDate": "2017-03-01",
      "endDate": "2018-02-01",
      "summary": "Deal Flow Power Tool for VC & PE.",
      "highlights": [
        "Responsibilities: programming; code review; coaching and experience transferring; requirement analysis, tasks breakdown and estimating.",
        "Technologies and tools: Clojure, Immutant, ClojureScript, Reagent, React, ReactBootstrap, HTML, JavaScript, SCSS, Datomic, AWS, Docker, JSON, EDN, Datalog, Git, Github, Trello, Youtrack, CircleCI."
      ]
    },
    {
      "company": "Cogniance",
      "position": "Senior Software Developer/Lead Software Developer/Software Architect",
      "startDate": "2012-08-01",
      "endDate": "2017-03-01",
      "summary": "My work spanned diverse projects, including developing a custom DWH and ETL for an advertising platform, contributing to a healthcare startup with a smart thermometer and mobile apps, creating a backup service for enterprises integrating with Dropbox and Box.com, and developing an advertising platform for engaging consumers through various media. My responsibilities included architecture design, leading development teams, and hands-on programming. I utilized technologies like Java, Spring Framework, Hibernate, and Hadoop, and managed databases. My role required skills in requirement analysis, technical documentation, and robust software development, showcasing my expertise in software architecture and development.",
      "highlights": [
        "Technologies and tools: Amazon EMR, Apache Tomcat, Box.com Client Lib, Cascading, Impala, Cascalog, Clojure, Docker, Docker Compose, Docker Machine, Docusign Client Lib, Dropbox Client Lib, Druid, Echosign Client Lib, Elasticsearch, Flywaydb, Git, H2, Hadoop, Hibernate, JPA, JSON, JUnit, Jackson, Java, Jenkins, Jira, Leiningen, Mockito, Mockito Git, MyBatis, MySQL, OAuth2, PostgreSQL, RabbitMQ, SQL, Solr, Sonar, Spring, Spring Boot, Spring Core, Spring Data, Stormpath, TeamCity, WADL, WSO2, XML, XSD."
      ]
    },
    {
      "company": "Ciklum",
      "position": "Senior Software Developer",
      "startDate": "2012-01-01",
      "endDate": "2012-08-01",
      "summary": "Poker, refactoring of legacy Poker game solution. Rewriting parts of existed poker servers.",
      "highlights": [
        "Responsibilities: requirement analysis and estimation; detail Design document writing; developing an application in Java; refactoring legacy code; collaborating with a 2-4-member software team; collaborating with a core team; continuous Integration adjustment; build process creating and adjustment.",
        "Technologies and tools: Playtech Poker Servers, Google Protobuf, Java, Groovy, XML, JSON, Black Box Testing, JUnit.  Jenkins CI, Apache Maven, Apache Ant, Sonar, Nexus, SVN, Jira, Icescrum."
      ]
    },
    {
      "company": "Topspin / Front Porch Digital (acquired by Oracle in 2014)",
      "position": "Senior Software Developer",
      "startDate": "2010-12-01",
      "endDate": "2011-12-01",
      "summary": "I was instrumental in developing a web service for Front Porch Digital's DIVA, a large media storage solution. This web service, built on the WSO2 Carbon platform, was designed to support both SOAP (described with WSDL 1.1) and REST (described with WSDL 2.0) protocols, facilitating integration with a multitude of television software partners. My responsibilities included requirement analysis and estimation, writing high-level and low-level design documents, and developing the application in Java. I collaborated with a 4-member software team and the customer team, managed the continuous integration process, and created and adjusted the build process.",
      "highlights": [
        "Technologies and tools: WSO2 Carbon, OSGi, Apache Axis2, Spring Framework, SoapUI, REST, SOAP Java, Groovy, WSDL, XML, XSD, WADL, Jenkins CI, Apache Maven, Sonar, Nexus, MKS, SVN, Trac."
      ]
    },
    {
      "company": "Exadel / John Hancock Investment Management",
      "position": "Software Developer",
      "startDate": "2010-09-01",
      "endDate": "2010-12-01",
      "summary": "An Intranet application for mutual funds accounting based on Spring Framework, Hibernate, JSF, JBPM, Quartz with MS SQL database and Apache Tomcat as a servlet container.",
      "highlights": [
        "Responsibilities: bug fixing; analyzing custom logic requirement and providing DSL based high-level solution.",
        "Technologies and tools: JSF, Hibernate, Spring Framework, Apache Tomcat, JBPM, Quartz,  Java, XML, JavaScript, HTML, Apache Maven, Sonar, SVN, Jira."
      ]
    },
    {
      "company": "Nighterra",
      "position": "Software Developer",
      "startDate": "2004-02-01",
      "endDate": "2010-09-01",
      "summary": "My responsibilities included implementing a release issue tool website, developing a web-based bank application for demonstrating test tool features, creating a tool for managing release rollouts, and developing a distributed service execution engine. Additionally, I refactored and developed new UI layers for an instant messenger, created a client inspector for a casino game application, developed a GIS system for warehouse goods management, and contributed to an Eclipse plugin for business process flow management.",
      "highlights": [
        "Technologies and tools: AWT, Apache ActiveMQ, Apache Ant, Apache Axis2, Apache Camel, Apache Maven, Apache Tomcat, Bugzilla, CVS, Castor, CookJS, CookSWT, CookXML, Derby, Dojo, Draw2D, Eclipse API, Excelsior Jet, Excelsior xFunction, FreeBSD, GEF, Geoserver, Geotools, Grails, Groovy, Hibernate, JDBC, JFace, JMS, JSP, JTS, JXTA, Jackrabbit, Java, JavaScript, Log4J, MSSQL, Oracle, PostgreSQL, Quartz, Rhino, SQL, SVN, SWT, Spring Framework, Swing, Toplink, VSS, WebSphere, Weblogic, XML, YUI."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Kyiv Clojure Users meetup",
      "position": "Host",
      "website": "https://web.archive.org/web/20220626031049/https://www.meetup.com/Kiev-Clojure-Users/",
      "startDate": "2013-01-01",
      "endDate": "2017-12-01",
      "summary": "The Kyiv Clojure Users group is a public meetup group based in Kyiv, organized by Andrew Panfilov and another individual. It comprises 253 members who share an interest in Clojure, a modern, dynamic, and functional programming language. This group is open to all skill levels, from beginners to advanced programmers. The primary aim of the group is to bring together Clojure enthusiasts for knowledge sharing and exploring functional programming on the JVM. The group has hosted a number of events, indicating active participation and regular meetups among its members."
    }
  ],
  "education": [
    {
      "institution": "Donetsk National Technical University",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2000-09-01",
      "endDate": "2004-07-01"
    }
  ],
  "publications": [
    {
      "name": "🎙️Podcast Episode (in Ukrainian)",
      "publisher": "Youtube",
      "releaseDate": "2025-02-05",
      "website": "https://www.youtube.com/watch?v=41IQpEWKOog",
      "summary": "A podcast about startup spirit, early-stage startups, the role of an architect, as well as society and cultural code."
    },
    {
      "name": "📌A Polygon-Free Ray Tracer: Rendering Bicubic Bézier Surfaces in Clojure",
      "publisher": "LinkedIn",
      "releaseDate": "2025-03-21",
      "website": "https://www.linkedin.com/pulse/polygon-free-ray-tracer-rendering-bicubic-b%C3%A9zier-clojure-panfilov-gdwcf/",
      "summary": "This project is primarily educational and was undertaken simply because I enjoy exploring these techniques. This article describes a ray-tracing system implemented in Clojure that renders a scene without using any polygons. Instead, it uses smooth, mathematically defined Bézier patches combined with spatial data structures to achieve high visual fidelity."
    },
    {
      "name": "📌How to build a vector embedding pipeline in Clojure with locally running LLM",
      "publisher": "LinkedIn",
      "releaseDate": "2024-08-16",
      "website": "https://www.linkedin.com/pulse/how-build-vector-embedding-pipeline-clojure-locally-running-panfilov-fdezf/",
      "summary": "\"Beating the average\" is important for those building a startup. The proper tooling and technologies are some of your non-market advantages. In 2001, Paul Graham wrote a blog post about how he achieved impressive results with the startup Viaweb. Over 20 years ago, Paul used the Lisp programming language in that startup. Today, Clojure is a nowadays Lisp. In this article, I explain how, by using Clojure and one of the most mature Java frameworks, you can build a pipeline for processing documents with the help of a locally running LLM."
    },
    {
      "name": "📌Chatbot Prototype: Architectural Proposal",
      "publisher": "LinkedIn",
      "releaseDate": "2024-05-23",
      "website": "https://www.linkedin.com/pulse/chatbot-prototype-architectural-proposal-andrew-panfilov-yjg4f/",
      "summary": "This article presents an example of an architectural proposal for creating an intelligent chatbot prototype with LLM. It can serve as useful learning material for those who have never written such documents, and for those who have written similar proposals, it may enrich their experience. In any case, I would be glad to hear readers' comments and discuss what should be added to or corrected in this document."
    },
    {
      "name": "📌Let's write a simple microservice in Clojure",
      "publisher": "LinkedIn",
      "releaseDate": "2024-04-11",
      "website": "https://www.linkedin.com/pulse/lets-write-simple-microservice-clojure-andrew-panfilov-2ghqe/",
      "summary": "The article provides a comprehensive guide to creating a simple microservice in Clojure, emphasizing the language's capability to leverage the extensive Java ecosystem. By utilizing Clojure, developers can significantly reduce the amount of code and boilerplate, leading to more efficient development."
    },
    {
      "name": "📌LLM pipeline for marketing research insights",
      "publisher": "LinkedIn",
      "releaseDate": "2024-01-17",
      "website": "https://www.linkedin.com/pulse/llm-pipeline-marketing-research-insights-andrew-panfilov-gt1bf/",
      "summary": "Insights on Building a Conversational AI Pipeline for Marketing Research."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Ukrainian",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "Russian",
      "fluency": "Native"
    }
  ],
  "interests": [
  ]
}
